Pandas - DataFrame and series
Panda is a powerful data manipulation library in python, widely used for data analysis and data cleaning. It provides two primary data structures : Series and DataFrame. A series is a one-dimensional array-like object, while a DataFrame is a two-dimensional , size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns )

In [1]:
!pip install pandas

Requirement already satisfied: pandas in e:\learning\my_learning_workspace\python\venv\lib\site-packages (2.3.0)
Requirement already satisfied: numpy>=1.26.0 in e:\learning\my_learning_workspace\python\venv\lib\site-packages (from pandas) (2.3.0)
Requirement already satisfied: python-dateutil>=2.8.2 in e:\learning\my_learning_workspace\python\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in e:\learning\my_learning_workspace\python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in e:\learning\my_learning_workspace\python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in e:\learning\my_learning_workspace\python\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd
data=[1,2,3,4,5]
series = pd.Series(data)
print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
## Create a Series from dictionary 
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data =[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
## DataFrame
## Create a Dataframe from a dictionary of list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [8]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Bangalore'],
       ['John', 30, 'New York'],
       ['Jack', 45, 'Florida']], dtype=object)

In [10]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'Jack','Age':32,'City':'Bangalore'}
]

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   Jack   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [24]:
df=pd.read_csv('sales_data.csv')
print(df.head(5))

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [25]:
print(df.tail(5))

     Transaction ID        Date Product Category  \
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

In [30]:
## Accessing  Data From DataFrame
data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Mumbai'},
    {'Name':'Bappy','Age':32,'City':'Chennai'},
    {'Name':'Jack','Age':32,'City':'Florida'}
]

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34     Mumbai
2  Bappy   32    Chennai
3   Jack   32    Florida
<class 'pandas.core.frame.DataFrame'>

In [31]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34     Mumbai
2  Bappy   32    Chennai
3   Jack   32    Florida

In [33]:

df['Name']

0    Krish
1     John
2    Bappy
3     Jack
Name: Name, dtype: object

In [ ]:
 df.loc[0]  ## row index

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [35]:
df.iloc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [36]:
df.iloc[0][0]

C:\Users\admin\AppData\Local\Temp\ipykernel_896\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Krish'

In [38]:
df.iloc[0][2]

C:\Users\admin\AppData\Local\Temp\ipykernel_896\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Bangalore'

In [40]:
## Accessing specified elements
df.at[1,'Age']

np.int64(34)

In [41]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34     Mumbai
2  Bappy   32    Chennai
3   Jack   32    Florida

In [42]:
df.at[2,'Name']

'Bappy'

In [43]:
## Accessing a specified element using iat
df.iat[2,2]

'Chennai'

In [44]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34     Mumbai
2  Bappy   32    Chennai
3   Jack   32    Florida

In [46]:
## Data manipulation with Dataframe
df['Salary']=[50000,60000,70000,80000]

In [47]:
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34     Mumbai   60000
2  Bappy   32    Chennai   70000
3   Jack   32    Florida   80000

In [ ]:
## Remove a dolumn
#df.drop('Salary') ##Key Error  since default axis is 0 (kind of y  vertical axis)
# to make it work
df.drop('Salary',axis=1) ## axis 1 is like having x axis horizontal axis

    Name  Age       City
0  Krish   32  Bangalore
1   John   34     Mumbai
2  Bappy   32    Chennai
3   Jack   32    Florida

In [ ]:
df ## above drop is temporary

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34     Mumbai   60000
2  Bappy   32    Chennai   70000
3   Jack   32    Florida   80000

In [51]:
## To drop permanently
df.drop('Salary',axis=1,inplace=True)

In [52]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34     Mumbai
2  Bappy   32    Chennai
3   Jack   32    Florida

In [53]:
## Add age to the column
df['Age']=df['Age']+1

In [54]:
df

    Name  Age       City
0  Krish   33  Bangalore
1   John   35     Mumbai
2  Bappy   33    Chennai
3   Jack   33    Florida

In [55]:
df.drop(0)

    Name  Age     City
1   John   35   Mumbai
2  Bappy   33  Chennai
3   Jack   33  Florida

In [56]:
df

    Name  Age       City
0  Krish   33  Bangalore
1   John   35     Mumbai
2  Bappy   33    Chennai
3   Jack   33    Florida

In [57]:
df.drop(0,inplace=True)

In [58]:
df

    Name  Age     City
1   John   35   Mumbai
2  Bappy   33  Chennai
3   Jack   33  Florida

In [59]:
df=pd.read_csv('sales_data.csv')

In [63]:
# Display the data type of each column
print("Data type : \n ",df.dtypes)

#Describe the DataFrame
print("Statistical summary:\n",df.describe())

Data type :
  Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

KeyError: 'Column not found: Value'